Revit 2026 API

# BuiltInFailuresRefPlaneFailures Class

---

Failures about RefPlane.

SystemObject Autodesk.Revit.DBBuiltInFailuresRefPlaneFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class RefPlaneFailures
```
```vb
Public NotInheritable Class RefPlaneFailures
```
```cpp
public ref class RefPlaneFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RefPlaneFailures = class end
```

The BuiltInFailuresRefPlaneFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AlreadyHaveTwoClosurePlanes | No more than two closure planes are allowed. |

#### Reference

Autodesk.Revit.DB Namespace